In [7]:
print('Hello again')

Hello again

In [8]:
print('Inserting cell below is B')

Inserting cell below is B

In [9]:
print('Cool')

Cool

# Markdown Heading

Let's make some _stuff_!

In [10]:
!ls

genderclassmodel.csv  gendermodel.csv  ivTitanic.ipynb	 test.csv
genderclassmodel.py   gendermodel.py   myfirstforest.py  train.csv

### Importing some libraries

In [5]:
import pandas as pd
import numpy as np
import pylab as pl
import matplotlib as mpl
import seaborn as sns
print('Imported!')

Imported!

In [6]:
train = pd.read_csv('train.csv')

In [8]:
type(train)
train[:3]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,NaN,S

In [12]:
train[:3]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,NaN,S